Tekla Open API Reference for Tekla Structures 2025
OkApplyCancel Events
The OkApplyCancel type exposes the following members.
Events
Name | Description
ApplyClicked
 The ApplyClicked event is raised when the Apply button is clicked.
CancelClicked
 The CancelClicked event is raised when the Cancel button is clicked.
OkClicked
 The OkClicked event is raised when the Ok button is clicked.
Top
See Also
Reference
OkApplyCancel Class
Tekla.Structures.Dialog.UIControls Namespace